nxp-zephyr/nxp-zephyr/soc/nxp/imxrt/imxrt118x/soc.c
/*
 * Copyright 2024-2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/init.h>
#include <zephyr/logging/log.h>
#include <soc.h>
#include <zephyr/linker/sections.h>
#include <zephyr/linker/linker-defs.h>
#include <zephyr/cache.h>
#include <fsl_clock.h>
#include <fsl_gpc.h>
#include <fsl_pmu.h>
#include <fsl_dcdc.h>
#include <fsl_ele_base_api.h>

extern void imxrt118x_trdc_enable_all_access(void);

#if defined(CONFIG_WDT_MCUX_RTWDOG)
#include <fsl_soc_src.h>
#endif
#include <zephyr/dt-bindings/clock/imx_ccm_rev2.h>
#include <cmsis_core.h>

LOG_MODULE_REGISTER(soc, CONFIG_SOC_LOG_LEVEL);

#if defined(CONFIG_CPU_CORTEX_M33) || !defined(CONFIG_SECOND_CORE_MCUX)
/*
 * RT118x ELE requires ping every 24 hours, which is mandatory,
 * otherwise soc may reset.
 *
 * Note:
 *   1. This is generic rule for all RT118x demos.
 *   2. We ping ELE every 23 (but not 24) hours, in case of any clock inaccuracy.
 *   3. This requirement comes from RT1180 SRM section 3.11 "ELE active timer".
 *      Refer to the SRM for more details.
 */
#define ELE_PING_INTERVAL_HOURS 23U
#define ELE_PING_INTERVAL_MS    (ELE_PING_INTERVAL_HOURS * 60UL * 60UL * 1000UL)

/* Software timer for ELE ping */
static struct k_timer ele_ping_timer;

/* ELE ping timer callback function */
static void ele_ping_timer_handler(struct k_timer *timer)
{
	ARG_UNUSED(timer);

	status_t status;

	/* Ping ELE to prevent SOC reset */
	status = ELE_BaseAPI_Ping(MU_RT_S3MUA);

	if (status == kStatus_Success) {
		LOG_DBG("ELE ping successful");
	} else {
		LOG_ERR("ELE ping failed with status: %d", status);
	}
}

/* Initialize ELE ping timer */
static int ele_ping_timer_init(void)
{
	/* Initialize the timer */
	k_timer_init(&ele_ping_timer, ele_ping_timer_handler, NULL);

	/* Start the periodic timer with 23-hour interval */
	k_timer_start(&ele_ping_timer, K_MSEC(ELE_PING_INTERVAL_MS),
		      K_MSEC(ELE_PING_INTERVAL_MS));

	LOG_DBG("ELE ping timer initialized, interval: %u hours", ELE_PING_INTERVAL_HOURS);

	return 0;
}

/* Initialize ELE ping timer at POST_KERNEL level to ensure kernel services are available */
SYS_INIT(ele_ping_timer_init, POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEFAULT);
#endif /* CONFIG_CPU_CORTEX_M33 || !CONFIG_SECOND_CORE_MCUX */

#if defined(CONFIG_NXP_IMXRT_BOOT_HEADER) && defined(CONFIG_CPU_CORTEX_M33)
#include <fsl_flexspi_nor_boot.h>

extern char __start[];
extern char _flash_used[];
extern char __rom_region_start[];
const __imx_boot_container_section container boot_header = {
	.hdr = {
		CNT_VERSION,
		CNT_SIZE,
		CNT_TAG_HEADER,
		CNT_FLAGS,
		CNT_SW_VER,
		CNT_FUSE_VER,
		CNT_NUM_IMG,
		sizeof(cnt_hdr) + CNT_NUM_IMG * sizeof(image_entry),
		0
	},
	.array = {
		{
			(uint32_t)CONFIG_CONTAINER_USER_IMAGE_OFFSET,
			(uint32_t)(_flash_used - CONFIG_CONTAINER_USER_IMAGE_OFFSET -
				CONFIG_IMAGE_CONTAINER_OFFSET),
			(uint32_t)_vector_start,
			0x00000000,
			(uint32_t)__start,
			0x00000000,
			IMG_FLAGS,
			0x0,
			{0},
			{0}
		},
	},
	.sign_block = {
		SGNBK_VERSION,
		SGNBK_SIZE,
		SGNBK_TAG,
		0x0,
		0x0,
		0x0,
		0x0
	},
};
#endif

/*
 * Set ELE_STICK_FAILED_STS to 0 when ELE status check is not required,
 * which is useful when debug reset, where the core has already get the
 * TRDC ownership at first time and ELE is not able to release TRDC
 * ownership again for the following TRDC ownership request.
 */
#define ELE_STICK_FAILED_STS 1

#if ELE_STICK_FAILED_STS
#define ELE_IS_FAILED(x) (x != kStatus_Success)
#else
#define ELE_IS_FAILED(x) false
#endif

/* When CM33 sets TRDC, CM7 must NOT require TRDC ownership from ELE */
#if defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M7)
/* When CONFIG_SECOND_CORE_MCUX then TRDC(AON/WAKEUP) ownership cannot be released
 * to CM33 and CM7 both in one ELE reset cycle.
 * Only CM33 will set TRDC.
 */
#define CM33_SET_TRDC 0U
#else
#define CM33_SET_TRDC 1U
#endif

#if (defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33))
/* Get CM7 partition address from device tree */
#define CM7_PARTITION_NODE DT_CHOSEN(zephyr_code_m7_partition)
#define CM7_FLASH_ADDR     DT_REG_ADDR(CM7_PARTITION_NODE)

/* Handle CM7 core initialization based on execution mode */
#if !defined(CONFIG_CM7_BOOT_FROM_FLASH)
#define CM7_BOOT_ADDRESS   (CM7_FLASH_ADDR + CONFIG_CM7_FLEXSPI_OFFSET - ADJUSTED_LMA)
#else
#define CM7_BOOT_ADDRESS   (CM7_FLASH_ADDR + CONFIG_CM7_FLEXSPI_OFFSET)
#endif /* defined(CONFIG_CM7_BOOT_FROM_FLASH) */
#endif /* (defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33)) */

#if defined(CONFIG_INIT_ARM_PLL) && \
	(defined(CONFIG_CPU_CORTEX_M33) || !defined(CONFIG_SECOND_CORE_MCUX))
static const clock_arm_pll_config_t armPllConfig_BOARD_BootClockRUN = {
	/* Post divider, 0 - DIV by 2, 1 - DIV by 4, 2 - DIV by 8, 3 - DIV by 1 */
	.postDivider = kCLOCK_PllPostDiv2,
	/* PLL Loop divider, Fout = Fin * ( loopDivider / ( 2 * postDivider ) ) */
	.loopDivider = 132,
};
#endif

#if defined(CONFIG_WDT_MCUX_RTWDOG)
#define RTWDOG_IF_SET_SRC(n, i)                                                                    \
	if (IS_ENABLED(DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(rtwdog##n), nxp_rtwdog, okay))) {    \
		SRC_SetGlobalSystemResetMode(SRC_GENERAL_REG, kSRC_Wdog##i##Reset,                 \
					     kSRC_ResetSystem);                                    \
	}
#endif

const clock_sys_pll1_config_t sysPll1Config_BOARD_BootClockRUN = {
	/* Enable Sys Pll1 divide-by-2 clock or not */
	.pllDiv2En = 1,
	/* Enable Sys Pll1 divide-by-5 clock or not */
	.pllDiv5En = 1,
	/* Spread spectrum parameter */
	.ss = NULL,
	/* Enable spread spectrum or not */
	.ssEnable = false,
};

const clock_sys_pll2_config_t sysPll2Config_BOARD_BootClockRUN = {
	/* Denominator of spread spectrum */
	.mfd = 268435455,
	/* Spread spectrum parameter */
	.ss = NULL,
	/* Enable spread spectrum or not */
	.ssEnable = false,
};

/* Function Name : board_flexspi_clock_safe_config
 * Description   : FLEXSPI clock source safe configuration weak function.
 *                 Called before clock source configuration.
 * Note          : Users may override this function to change FLEXSPI clock source to a stable
 *                 source when executing code on FLEXSPI memory(XIP). If XIP, the function
 *                 should run in RAM and move the FLEXSPI clock source to a stable clock
 *                 to avoid instruction/data fetch issue during clock updating.
 */
__attribute__((weak)) void board_flexspi_clock_safe_config(void)
{
#if defined(CONFIG_FLASH_MCUX_FLEXSPI_XIP)
	/* Move FLEXSPI clock source to OSC_RC_24M to avoid instruction/data fetch
	 * issue in XIP when updating PLL.
	 */
	flexspi_clock_root_update(FLEXSPI1, kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc24M, 1U);
#endif
}

/**
 * @brief Initialize the system clock
 */
__weak void clock_init(void)
{
	clock_root_config_t rootCfg = {0};

#if defined(CONFIG_CPU_CORTEX_M33) || !defined(CONFIG_SECOND_CORE_MCUX)
	/* Init OSC RC 400M */
	CLOCK_OSC_EnableOscRc400M();
#endif

#if CONFIG_CPU_CORTEX_M7
	/* Switch both core to OscRC400M first */
	rootCfg.mux = kCLOCK_M7_ClockRoot_MuxOscRc400M;
	rootCfg.div = 1;
	CLOCK_SetRootClock(kCLOCK_Root_M7, &rootCfg);
#endif

#if CONFIG_CPU_CORTEX_M33
	rootCfg.mux = kCLOCK_M33_ClockRoot_MuxOscRc400M;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_M33, &rootCfg);
#endif

#if CONFIG_CPU_CORTEX_M7
	DCDC_SetVDD1P0BuckModeTargetVoltage(DCDC, kDCDC_CORE0, kDCDC_1P0Target1P125V);
	DCDC_SetVDD1P0BuckModeTargetVoltage(DCDC, kDCDC_CORE1, kDCDC_1P0Target1P125V);
	/* FBB need to be enabled in OverDrive(OD) mode */
	PMU_EnableFBB(ANADIG_PMU, true);
#endif

#if defined(CONFIG_CPU_CORTEX_M33) || !defined(CONFIG_SECOND_CORE_MCUX)
	/* Config CLK_1M */
	CLOCK_OSC_Set1MHzOutputBehavior(kCLOCK_1MHzOutEnableFreeRunning1Mhz);

