nxp-zephyr/nxp-zephyr/soc/nxp/imxrt/imxrt118x/soc.c
	/* Init OSC RC 24M */
	CLOCK_OSC_EnableOscRc24M(true);

	/* Config OSC 24M */
	ANADIG_OSC->OSC_24M_CTRL |= ANADIG_OSC_OSC_24M_CTRL_OSC_EN(1) |
	ANADIG_OSC_OSC_24M_CTRL_BYPASS_EN(0) | ANADIG_OSC_OSC_24M_CTRL_LP_EN(1) |
	ANADIG_OSC_OSC_24M_CTRL_OSC_24M_GATE(0);

	/* Wait for 24M OSC to be stable. */
	while (ANADIG_OSC_OSC_24M_CTRL_OSC_24M_STABLE_MASK !=
			(ANADIG_OSC->OSC_24M_CTRL & ANADIG_OSC_OSC_24M_CTRL_OSC_24M_STABLE_MASK)) {
	}

	/* Call function board_flexspi_clock_safe_config() to move FlexSPI clock to a stable
	 * clock source to avoid instruction/data fetch issue when updating PLL if XIP
	 * (execute code on FLEXSPI memory).
	 */
	board_flexspi_clock_safe_config();

#ifdef CONFIG_INIT_ARM_PLL
	/* Init Arm Pll. */
	CLOCK_InitArmPll(&armPllConfig_BOARD_BootClockRUN);
#endif

	/* Init Sys Pll1. */
	CLOCK_InitSysPll1(&sysPll1Config_BOARD_BootClockRUN);

	/* Init Sys Pll2. */
	CLOCK_InitSysPll2(&sysPll2Config_BOARD_BootClockRUN);
	/* Init System Pll2 pfd0. */
	CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd0, 27);
	/* Init System Pll2 pfd1. */
	CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd1, 16);
	/* Init System Pll2 pfd2. */
	CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd2, 24);
	/* Init System Pll2 pfd3. */
	CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd3, 32);

	/* Init Sys Pll3. */
	CLOCK_InitSysPll3();
	/* Init System Pll3 pfd0. */
	CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 22);
	/* Init System Pll3 pfd1. */
	CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd1, 33);
	/* Init System Pll3 pfd2. */
	CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd2, 22);
	/* Init System Pll3 pfd3. */
	CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd3, 18);

	/* Bypass Audio Pll. */
	CLOCK_SetPllBypass(kCLOCK_PllAudio, true);
	/* DeInit Audio Pll. */
	CLOCK_DeinitAudioPll();
#endif /* CONFIG_CPU_CORTEX_M33 || !CONFIG_SECOND_CORE_MCUX */

#if defined(CONFIG_CPU_CORTEX_M7)
	/* Module clock root configurations. */
	/* Configure M7 using ARM_PLL_CLK */
	rootCfg.mux = kCLOCK_M7_ClockRoot_MuxArmPllOut;
	rootCfg.div = 1;
	CLOCK_SetRootClock(kCLOCK_Root_M7, &rootCfg);
#endif

#if defined(CONFIG_CPU_CORTEX_M33)
	/* Configure M33 using SYS_PLL3_CLK */
	rootCfg.mux = kCLOCK_M33_ClockRoot_MuxSysPll3Out;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_M33, &rootCfg);
#endif

#if defined(CONFIG_CPU_CORTEX_M33) || !defined(CONFIG_SECOND_CORE_MCUX)
	/* Configure BUS_AON using SYS_PLL2_CLK */
	rootCfg.mux = kCLOCK_BUS_AON_ClockRoot_MuxSysPll2Out;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Bus_Aon, &rootCfg);

	/* Configure BUS_WAKEUP using SYS_PLL2_CLK */
	rootCfg.mux = kCLOCK_BUS_WAKEUP_ClockRoot_MuxSysPll2Out;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Bus_Wakeup, &rootCfg);

	/* Configure WAKEUP_AXI using SYS_PLL3_CLK */
	rootCfg.mux = kCLOCK_WAKEUP_AXI_ClockRoot_MuxSysPll3Out;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Wakeup_Axi, &rootCfg);

	/* Configure SWO_TRACE using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_SWO_TRACE_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Swo_Trace, &rootCfg);
#endif /* CONFIG_CPU_CORTEX_M33 || !CONFIG_SECOND_CORE_MCUX */

#if CONFIG_CPU_CORTEX_M33
	/* Configure M33_SYSTICK using OSC_24M */
	rootCfg.mux = kCLOCK_M33_SYSTICK_ClockRoot_MuxOsc24MOut;
	rootCfg.div = 240;
	CLOCK_SetRootClock(kCLOCK_Root_M33_Systick, &rootCfg);
#endif

#if CONFIG_CPU_CORTEX_M7
	/* Configure M7_SYSTICK using OSC_24M */
	rootCfg.mux = kCLOCK_M7_SYSTICK_ClockRoot_MuxOsc24MOut;
	rootCfg.div = 240;
	CLOCK_SetRootClock(kCLOCK_Root_M7_Systick, &rootCfg);
#endif

#if defined(CONFIG_UART_MCUX_LPUART)

#if	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart1)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart2)))
	/* Configure LPUART0102 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPUART0102_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_Lpuart0102, &rootCfg);
#endif

#if	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart3)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart4)))
	/* Configure LPUART0304 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPUART0304_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_Lpuart0304, &rootCfg);
#endif

#if	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart5)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart6)))
	/* Configure LPUART0506 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPUART0506_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_Lpuart0506, &rootCfg);
#endif

#if	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart7)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart8)))
	/* Configure LPUART0708 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPUART0708_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_Lpuart0708, &rootCfg);
#endif

#if	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart9)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart10)))
	/* Configure LPUART0910 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPUART0910_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_Lpuart0910, &rootCfg);
#endif

#if	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart11)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpuart12)))
	/* Configure LPUART1112 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPUART1112_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_Lpuart1112, &rootCfg);
#endif

#endif /* CONFIG_UART_MCUX_LPUART */

#if defined(CONFIG_I2C_MCUX_LPI2C) && \
	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpi2c1)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpi2c2)))
	/* Configure LPI2C0102 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPI2C0102_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Lpi2c0102, &rootCfg);
#endif

#if defined(CONFIG_I2C_MCUX_LPI2C) && \
	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpi2c3)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpi2c4)))
	/* Configure LPI2C0304 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPI2C0304_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Lpi2c0304, &rootCfg);
#endif

#if defined(CONFIG_I2C_MCUX_LPI2C) && \
	(DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpi2c5)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(lpi2c6)))
	/* Configure LPI2C0506 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPI2C0506_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Lpi2c0506, &rootCfg);
#endif

