nxp-zephyr/nxp-zephyr/soc/nxp/imxrt/imxrt118x/soc.c
#if defined(CONFIG_SPI_NXP_LPSPI)

#if	(DT_NODE_HAS_STATUS(DT_NODELABEL(lpspi1), okay) \
	|| DT_NODE_HAS_STATUS(DT_NODELABEL(lpspi2), okay))
	/* Configure LPSPI0102 using SYS_PLL3_PFD1_CLK */
	rootCfg.mux = kCLOCK_LPSPI0102_ClockRoot_MuxSysPll3Pfd1;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Lpspi0102, &rootCfg);
#endif

#if	(DT_NODE_HAS_STATUS(DT_NODELABEL(lpspi3), okay) \
	|| DT_NODE_HAS_STATUS(DT_NODELABEL(lpspi4), okay))
	/* Configure LPSPI0304 using SYS_PLL3_PFD1_CLK */
	rootCfg.mux = kCLOCK_LPSPI0304_ClockRoot_MuxSysPll3Pfd1;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Lpspi0304, &rootCfg);
#endif

#if (DT_NODE_HAS_STATUS(DT_NODELABEL(lpspi5), okay) \
	|| DT_NODE_HAS_STATUS(DT_NODELABEL(lpspi6), okay))
	/* Configure LPSPI0506 using SYS_PLL3_PFD1_CLK */
	rootCfg.mux = kCLOCK_LPSPI0506_ClockRoot_MuxSysPll3Pfd1;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Lpspi0506, &rootCfg);
#endif

#endif /* CONFIG_SPI_NXP_LPSPI */

#if defined(CONFIG_COUNTER_MCUX_GPT)

#if (DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(gpt1)))
	/* Configure GPT1 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_GPT1_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 1;
	CLOCK_SetRootClock(kCLOCK_Root_Gpt1, &rootCfg);
#endif /* DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(gpt1)) */

#if (DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(gpt2)))
	/* Configure GPT2 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_GPT2_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 1;
	CLOCK_SetRootClock(kCLOCK_Root_Gpt2, &rootCfg);
#endif /* DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(gpt2)) */

#endif /* CONFIG_COUNTER_MCUX_GPT */

#if defined(CONFIG_COMPARATOR_MCUX_ACMP) || defined(CONFIG_SENSOR_MCUX_ACMP)

#if (DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(acmp1))  \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(acmp2)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(acmp3)) \
	|| DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(acmp4)))
	/* Configure ACMP using MuxSysPll3Out */
	rootCfg.mux = kCLOCK_ACMP_ClockRoot_MuxSysPll3Out;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Acmp, &rootCfg);
#endif

#endif /* CONFIG_COMPARATOR_MCUX_ACMP || CONFIG_SENSOR_MCUX_ACMP */

#if defined(CONFIG_ETH_NXP_IMX_NETC) && (DT_CHILD_NUM_STATUS_OKAY(DT_NODELABEL(netc)) != 0)
	/* Configure ENET using SYS_PLL1_DIV2_CLK */
	rootCfg.mux = kCLOCK_ENET_ClockRoot_MuxSysPll1Div2;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Enet, &rootCfg);

	/* Configure TMR_1588 using SYS_PLL3_CLK */
	rootCfg.mux = kCLOCK_TMR_1588_ClockRoot_MuxSysPll3Out;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Tmr_1588, &rootCfg);

	/* Configure NETC using SYS_PLL3_PFD3_CLK */
	rootCfg.mux = kCLOCK_NETC_ClockRoot_MuxSysPll3Pfd3;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Netc, &rootCfg);

	/* Configure MAC0 using SYS_PLL1_DIV2_CLK */
	rootCfg.mux = kCLOCK_MAC0_ClockRoot_MuxSysPll1Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_Mac0, &rootCfg);

	/* Configure MAC1 using SYS_PLL1_DIV2_CLK */
	rootCfg.mux = kCLOCK_MAC1_ClockRoot_MuxSysPll1Div2;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Mac1, &rootCfg);

	/* Configure MAC2 using SYS_PLL1_DIV2_CLK */
	rootCfg.mux = kCLOCK_MAC2_ClockRoot_MuxSysPll1Div2;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Mac2, &rootCfg);

	/* Configure MAC3 using SYS_PLL1_DIV2_CLK */
	rootCfg.mux = kCLOCK_MAC3_ClockRoot_MuxSysPll1Div2;
	rootCfg.div = 4;
	CLOCK_SetRootClock(kCLOCK_Root_Mac3, &rootCfg);

	/* Configure MAC4 using SYS_PLL1_DIV2_CLK */
	rootCfg.mux = kCLOCK_MAC4_ClockRoot_MuxSysPll1Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_Mac4, &rootCfg);

	/* Set NETC PORT Ref clock source. */
	BLK_CTRL_WAKEUPMIX->NETC_PORT_MISC_CFG &=
		~BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_PORT0_RMII_REF_CLK_DIR_MASK;
	BLK_CTRL_WAKEUPMIX->NETC_PORT_MISC_CFG &=
		~BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_PORT1_RMII_REF_CLK_DIR_MASK;
	BLK_CTRL_WAKEUPMIX->NETC_PORT_MISC_CFG &=
		~BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_PORT2_RMII_REF_CLK_DIR_MASK;
	BLK_CTRL_WAKEUPMIX->NETC_PORT_MISC_CFG &=
		~BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_PORT3_RMII_REF_CLK_DIR_MASK;
	BLK_CTRL_WAKEUPMIX->NETC_PORT_MISC_CFG &=
		~BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_PORT4_RMII_REF_CLK_DIR_MASK;

	/* Set TMR 1588 Ref clock source. */
	BLK_CTRL_WAKEUPMIX->NETC_PORT_MISC_CFG |=
		BLK_CTRL_WAKEUPMIX_NETC_PORT_MISC_CFG_TMR_EXT_CLK_SEL_MASK;
#endif

#ifdef CONFIG_CAN_MCUX_FLEXCAN

#if DT_NODE_HAS_STATUS(DT_NODELABEL(flexcan1), okay)
	/* Configure CAN1 using MuxSysPll3Out */
	rootCfg.mux = kCLOCK_CAN1_ClockRoot_MuxSysPll3Out;
	rootCfg.div = 6;
	CLOCK_SetRootClock(kCLOCK_Root_Can1, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(flexcan2), okay)
	/* Configure CAN2 using MuxSysPll3Out */
	rootCfg.mux = kCLOCK_CAN2_ClockRoot_MuxSysPll3Out;
	rootCfg.div = 6;
	CLOCK_SetRootClock(kCLOCK_Root_Can2, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(flexcan3), okay)
	/* Configure CAN3 using MuxSysPll3Out */
	rootCfg.mux = kCLOCK_CAN3_ClockRoot_MuxSysPll3Out;
	rootCfg.div = 6;
	CLOCK_SetRootClock(kCLOCK_Root_Can3, &rootCfg);
#endif

#endif /* CONFIG_CAN_MCUX_FLEXCAN */

#ifdef CONFIG_MCUX_FLEXIO

#if DT_NODE_HAS_STATUS(DT_NODELABEL(flexio1), okay)
	/* Configure FLEXIO1 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_FLEXIO1_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Flexio1, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(flexio2), okay)
	/* Configure FLEXIO2 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_FLEXIO2_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 1;
	CLOCK_SetRootClock(kCLOCK_Root_Flexio2, &rootCfg);
#endif

#endif /* CONFIG_MCUX_FLEXIO */

#if defined(CONFIG_MCUX_LPTMR_TIMER) || defined(CONFIG_COUNTER_MCUX_LPTMR)

#if DT_NODE_HAS_STATUS(DT_NODELABEL(lptmr1), okay)
	/* Configure LPTIMER1 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPTIMER1_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Lptimer1, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(lptmr2), okay)
	/* Configure LPTIMER2 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPTIMER2_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Lptimer2, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(lptmr3), okay)
	/* Configure LPTIMER3 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_LPTIMER3_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Lptimer3, &rootCfg);
#endif

#endif /* CONFIG_MCUX_LPTMR_TIMER || CONFIG_COUNTER_MCUX_LPTMR */

