nxp-zephyr/nxp-zephyr/soc/nxp/imxrt/imxrt118x/soc.c
#if !(DT_NODE_HAS_COMPAT(DT_CHOSEN(zephyr_flash_controller), nxp_imx_flexspi_nor)) &&  \
	defined(CONFIG_MEMC_MCUX_FLEXSPI) && DT_NODE_HAS_STATUS(DT_NODELABEL(flexspi), okay)
	/* Configure FLEXSPI1 using SYS_PLL3_PFD0_CLK */
	rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
#elif defined(CONFIG_FLASH_MCUX_FLEXSPI_XIP) && \
	(defined(CONFIG_CPU_CORTEX_M33) || !defined(CONFIG_SECOND_CORE_MCUX))
	/* Update the FLEXSPI1 using SYS_PLL3_PFD0_CLK safely when doing XIP.
	 * This function executes in RAM and shall not be called from the secondary core
	 * in a multicore setup.
	 */
	flexspi_clock_root_update(FLEXSPI1, kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0, 3U);
#endif

#if !(DT_NODE_HAS_COMPAT(DT_CHOSEN(zephyr_flash_controller), nxp_imx_flexspi_nor)) &&  \
	defined(CONFIG_MEMC_MCUX_FLEXSPI) && DT_NODE_HAS_STATUS(DT_NODELABEL(flexspi2), okay)
	/* Configure FLEXSPI2 using SYS_PLL3_PFD2_CLK */
	rootCfg.mux = kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Flexspi2, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(tpm2), okay)
	/* Configure TPM2 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_TPM2_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Tpm2, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(tpm4), okay)
	/* Configure TPM4 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_TPM4_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Tpm4, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(tpm5), okay)
	/* Configure TPM5 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_TPM5_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Tpm5, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(tpm6), okay)
	/* Configure TPM6 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_TPM6_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Tpm6, &rootCfg);
#endif

#ifdef CONFIG_DT_HAS_NXP_MCUX_I3C_ENABLED

#if DT_NODE_HAS_STATUS(DT_NODELABEL(i3c1), okay)
	/* Configure I3C1 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_I3C1_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_I3c1, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(i3c2), okay)
	/* Configure I3C2 using SYS_PLL3_DIV2_CLK */
	rootCfg.mux = kCLOCK_I3C2_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 10;
	CLOCK_SetRootClock(kCLOCK_Root_I3c2, &rootCfg);
#endif

#endif /* CONFIG_DT_HAS_NXP_MCUX_I3C_ENABLED */

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(usb1)) && CONFIG_UDC_NXP_EHCI
	CLOCK_EnableUsbhs0PhyPllClock(kCLOCK_Usb480M,
		DT_PROP_BY_PHANDLE(DT_NODELABEL(usb1), clocks, clock_frequency));
	CLOCK_EnableUsbhs0Clock(kCLOCK_Usb480M,
		DT_PROP_BY_PHANDLE(DT_NODELABEL(usb1), clocks, clock_frequency));
#endif

#if DT_NODE_HAS_STATUS_OKAY(DT_NODELABEL(usb2)) && CONFIG_UDC_NXP_EHCI
	CLOCK_EnableUsbhs1PhyPllClock(kCLOCK_Usb480M,
		DT_PROP_BY_PHANDLE(DT_NODELABEL(usb2), clocks, clock_frequency));
	CLOCK_EnableUsbhs1Clock(kCLOCK_Usb480M,
		DT_PROP_BY_PHANDLE(DT_NODELABEL(usb2), clocks, clock_frequency));
#endif

#ifdef CONFIG_IMX_USDHC

#if DT_NODE_HAS_STATUS(DT_NODELABEL(usdhc1), okay)
	/* Configure USDHC1 using SysPll2Pfd2 */
	rootCfg.mux = kCLOCK_USDHC1_ClockRoot_MuxSysPll2Pfd2;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Usdhc1, &rootCfg);
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(usdhc2), okay)
	/* Configure USDHC2 using SysPll2Pfd2 */
	rootCfg.mux = kCLOCK_USDHC2_ClockRoot_MuxSysPll2Pfd2;
	rootCfg.div = 2;
	CLOCK_SetRootClock(kCLOCK_Root_Usdhc2, &rootCfg);
#endif

#endif /* CONFIG_IMX_USDHC */

#ifdef CONFIG_COUNTER_MCUX_LPIT
	/* LPIT1 use BUS_AON, LPIT2 use BUS_WAKEUP, which have been configured */
#if DT_NODE_HAS_STATUS(DT_NODELABEL(lpit3), okay)
	/* Configure LPIT3 using SysPll3Div2 */
	rootCfg.mux = kCLOCK_LPIT3_ClockRoot_MuxSysPll3Div2;
	rootCfg.div = 3;
	CLOCK_SetRootClock(kCLOCK_Root_Lpit3, &rootCfg);
#endif
#endif /* CONFIG_COUNTER_MCUX_LPIT */

	/* Keep core clock ungated during WFI */
	CCM->LPCG[1].LPM0 = 0x33333333;
	CCM->LPCG[1].LPM1 = 0x33333333;

	/* Let the core clock still running in WAIT mode */
	BLK_CTRL_S_AONMIX->M7_CFG |= BLK_CTRL_S_AONMIX_M7_CFG_CORECLK_FORCE_ON_MASK;

	/* Make AHB clock run (enabled) when CM7 is sleeping and TCM is accessible */
	BLK_CTRL_S_AONMIX->M7_CFG |= BLK_CTRL_S_AONMIX_M7_CFG_HCLK_FORCE_ON_MASK;

	/* Keep the system clock running so SYSTICK can wake up
	 * the system from wfi.
	 */
	GPC_CM_SetNextCpuMode(0, kGPC_RunMode);
	GPC_CM_SetNextCpuMode(1, kGPC_RunMode);
	GPC_CM_EnableCpuSleepHold(0, false);
	GPC_CM_EnableCpuSleepHold(1, false);
}

#ifdef CONFIG_I2S_MCUX_SAI
void imxrt_audio_codec_pll_init(uint32_t clock_name, uint32_t clk_src, uint32_t clk_pre_div,
				uint32_t clk_src_div)
{
	ARG_UNUSED(clk_pre_div);

	switch (clock_name) {
	case IMX_CCM_SAI1_CLK:
		CLOCK_SetRootClockMux(kCLOCK_Root_Sai1, clk_src);
		CLOCK_SetRootClockDiv(kCLOCK_Root_Sai1, clk_src_div);
		break;
	case IMX_CCM_SAI2_CLK:
		CLOCK_SetRootClockMux(kCLOCK_Root_Sai2, clk_src);
		CLOCK_SetRootClockDiv(kCLOCK_Root_Sai2, clk_src_div);
		break;
	case IMX_CCM_SAI3_CLK:
		CLOCK_SetRootClockMux(kCLOCK_Root_Sai3, clk_src);
		CLOCK_SetRootClockDiv(kCLOCK_Root_Sai3, clk_src_div);
		break;
	case IMX_CCM_SAI4_CLK:
		CLOCK_SetRootClockMux(kCLOCK_Root_Sai4, clk_src);
		CLOCK_SetRootClockDiv(kCLOCK_Root_Sai4, clk_src_div);
		break;
	default:
		return;
	}
}
#endif /* CONFIG_I2S_MCUX_SAI */


/**
 * @brief Initialize the system clock
 */
static ALWAYS_INLINE void trdc_enable_all_access(void)
{
	imxrt118x_trdc_enable_all_access();
}

/**
 *
 * @brief Perform basic hardware initialization
 *
 * Initialize the interrupt controller device drivers.
 * Also initialize the timer device driver, if required.
 * If dual core operation is enabled, the second core image will be loaded to RAM
 *
 * @return 0
 */

void soc_early_init_hook(void)
{
	/* Initialize system clock */
	clock_init();

#if (defined(CM33_SET_TRDC) && (CM33_SET_TRDC > 0U))
	/* Get trdc and enable all access modes for MBC and MRC of TRDCA and TRDCW */
	trdc_enable_all_access();
#endif /* (defined(CM33_SET_TRDC) && (CM33_SET_TRDC > 0U) */

#if defined(CONFIG_WDT_MCUX_RTWDOG)
	/* Unmask the watchdog reset channel */
	RTWDOG_IF_SET_SRC(0, 1)
	RTWDOG_IF_SET_SRC(1, 2)
	RTWDOG_IF_SET_SRC(2, 3)
	RTWDOG_IF_SET_SRC(3, 4)
	RTWDOG_IF_SET_SRC(4, 5)

	/* Clear the reset status otherwise TCM memory will reload in next reset */
	uint32_t mask = SRC_GetResetStatusFlags(SRC_GENERAL_REG);

