nxp-zephyr/nxp-zephyr/soc/nxp/imxrt/imxrt118x/soc.c
	SRC_ClearGlobalSystemResetStatus(SRC_GENERAL_REG, mask);
#endif /* defined(CONFIG_WDT_MCUX_RTWDOG) */

#if (defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33))
#if !defined(CONFIG_CM7_BOOT_FROM_FLASH)
#include <zephyr_image_info.h>

/* Determine if CM33 needs to adjust the address to access CM7 memory */
#if ((CM7_BOOT_ADDRESS >= 0U) && (CM7_BOOT_ADDRESS <= 0x1FFFFU))
	/* Adjust to CM33 address to access CM7 ITCM */
	#define MEMMAP_ADJUST 0x303C0000U
#else
	#define MEMMAP_ADJUST 0U /* No adjustment needed */
#endif

/* Memcpy macro to copy segments from secondary core image stored in flash
 * to RAM section that secondary core boots from.
 * n is the segment number, as defined in zephyr_image_info.h
 */
#define MEMCPY_SEGMENT(n, _)						\
	memcpy((uint32_t *)(((SEGMENT_LMA_ADDRESS_ ## n)		\
			- ADJUSTED_LMA) + MEMMAP_ADJUST),		\
		(uint32_t *)(SEGMENT_LMA_ADDRESS_ ## n),		\
		(SEGMENT_SIZE_ ## n))

	/**
	 * Copy CM7 core from flash to memory. Note that depending on where the
	 * user decided to store CM7 code, this is likely going to read from the
	 * flexspi while using XIP. Provided we DO NOT WRITE TO THE FLEXSPI,
	 * this operation is safe.
	 *
	 * Note that this copy MUST occur before enabling the M33 caching to
	 * ensure the data is written directly to RAM (since the M4 core will use it)
	 */
	LISTIFY(SEGMENT_NUM, MEMCPY_SEGMENT, (;));
#endif /* !defined(CONFIG_CM7_BOOT_FROM_FLASH) */
#endif /* (defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33)) */

	/* Enable data cache */
	sys_cache_data_enable();

	/**
	 * Temporary disable cache as we need write-trough mode to operate ELE
	 */
#if defined(CONFIG_PSA_CRYPTO_DRIVER_ELE_S4xx)
	sys_cache_data_disable();
#endif /* CONFIG_PSA_CRYPTO_DRIVER_ELE_S4XX */

	__ISB();
	__DSB();
}

#ifdef CONFIG_SOC_RESET_HOOK
void soc_reset_hook(void)
{
	SystemInit();

#if defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33)
	Prepare_CM7(CM7_BOOT_ADDRESS);
#endif
}
#endif

#if defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M33)

static int second_core_boot(void)
{
	/*
	 * RT1180 Specific CM7 Kick Off operation
	 */
	/* Trigger S401 */
	while ((MU_RT_S3MUA->TSR & MU_TSR_TE0_MASK) == 0) {
		; } /* Wait TR empty */
	MU_RT_S3MUA->TR[0] = 0x17d20106;
	while ((MU_RT_S3MUA->RSR & MU_RSR_RF0_MASK) == 0) {
		; } /* Wait RR Full */
	while ((MU_RT_S3MUA->RSR & MU_RSR_RF1_MASK) == 0) {
		; } /* Wait RR Full */

	/* Response from ELE must be always read */
	__attribute__((unused)) volatile uint32_t result1, result2;
	result1 = MU_RT_S3MUA->RR[0];
	result2 = MU_RT_S3MUA->RR[1];

	/* Disable M7 clock before clearing CPU_WAIT bit */
	CLOCK_DisableClock(kCLOCK_M7);

	/* Deassert Wait */
	BLK_CTRL_S_AONMIX->M7_CFG =
		(BLK_CTRL_S_AONMIX->M7_CFG & (~BLK_CTRL_S_AONMIX_M7_CFG_WAIT_MASK)) |
		BLK_CTRL_S_AONMIX_M7_CFG_WAIT(0);

	/* Re-enable M7 clock again */
	CLOCK_EnableClock(kCLOCK_M7);

	return 0;
}

SYS_INIT(second_core_boot, POST_KERNEL, CONFIG_APPLICATION_INIT_PRIORITY);
#endif
